/*Урок 1. Принципы ООП: Инкапсуляция, наследование, полиморфизм
        При решении этих задач следуйте принципам абстракции, инкапсуляции, наследования, полиморфизма.
        Создайте унаследованный класс ГорячийНапиток с дополнительным полем int температура.
        Создайте класс АвтоматГорячихНапитков, реализующий интерфейс ТорговыйАвтомат и
        реализуйте перегруженный метод getProduct(int name, int volume, int temperature),
        выдающий продукт, соответствующий имени, объему и температуре.
        В main проинициализируйте несколько ГорячихНапитков и АвтоматГорячихНапитков
        и позвольте покупателю купить товар.*/


public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}